app/Repository/PostRepository.php

select * from `posts`
select * from `users` where `users`.`id` in (1)
---
    public function getPostsWithAuthor()
    {
        return Post::with('user')->get();