app/Services/PostService.php

select * from `posts` where `posts`.`id` = 3 limit 1
update `posts` set `moderation_status_id` = 3, `posts`.`updated_at` = '2024-10-01 13:37:54' where `id` = 3
---
    public function update_moderate_status(int $id, int $status_id)
    {
        $updateStatus = Post::findOrFail($id)->update([
            'moderation_status_id' => $status_id
        ]);

insert into `posts` (`name`, `text`, `cover`, `user_id`, `moderation_status_id`, `updated_at`, `created_at`) values ('Давид', 'ввв', 'uploads/1DnrPv7Fk3ykYL67WwbA7ly0gNI9XRaEZp6ZdEPx.jpg', 1, '1', '2024-10-01 13:31:11', '2024-10-01 13:31:11')
---
    public function create(string $name, string $text, string $cover, int $userId)
    {
        $updateStatus = Post::create([
            'name' => $name,
            'text' => $text,
            'cover' => $cover,
            'user_id' => $userId,
            'moderation_status_id' => '1'
        ]);